Revit 2025 API
RebarHostCategory Enumeration
 Rebar host category
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RebarHostCategory
Public Enumeration RebarHostCategory
public enum class RebarHostCategory
type RebarHostCategory
Members
Member name | Value | Description
Other | 0 |  Unknown or invalid host.
Part | 1 |  Part.
StructuralColumn | 2 |  Structural Column.
StructuralFraming | 3 |  Structural Framing.
Wall | 4 |  Wall.
Floor | 5 |  Floor.
StructuralFoundation | 6 |  Structural Foundation.
Stairs | 7 |  Stairs.
SlabEdge | 8 |  Slab Edge.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace